{
    "qna": [
        {
            "q": "박종찬 후기 리뷰",
            "a": "이번 프로젝트를 진행하면서 가장 인상 깊었던 점은 각자의 역할에 충실하며 서로 도와가며 프로젝트를 완성해나갔다는 것입니다. 팀원 분들의 노력과 성장을 직접 느낄 수 있었습니다. 프로젝트를 진행하면서 보안과 동작 흐름에 대해 깊이 있게 공부하고 다양한 기술을 적용하면서 어려움을 겪었지만 그 과정에서 배운 것들이 큰 도움이 되었습니다. 또한 팀원 간의 협업을 통해 기능을 연동하는 과정에서 많은 경험을 쌓을 수 있었습니다. 특히 팀원 분들의 뛰어난 역할 수행 덕분에 도커 패키지와 이미지, 서버를 자동으로 설치하고 활성화하는 쉘 스크립트를 작성 할 수 있었습니다. 이는 팀원 분들의 노력과 기여가 있었기에 가능했다고 생각합니다. 팀원 분들에게 깊은 감사의 마음을 가지고 있습니다. 이번 프로젝트를 통해 팀원 분들이 성장하셨듯이 저 또한 많은 것을 배울 수 있었습니다. 이번 경험은 앞으로의 성장에 큰 도움이 될 것이라 믿습니다."
        },
        {
            "q": "이지우 후기 리뷰",
            "a": "작년 프로젝트 보안이나 웹의 동작 흐름을 모른채 사용했던 소셜 로그인 API를 적용해보면서 보안과 동작 흐름에 대해 자세하게 공부하는 기회가 되었습니다. API를 기능적으로만 생각하고 무작정 추가하는것이 아니라 동작 흐름과 세부 내용을 파악하면 API를 더욱 효과적으로 사용할 수 있다는 것을 느꼈습니다. 배경지식이 있는 상태에서 다양한 다른 요소를 생각하면서 적용하다보니 작년보다 적용이 더 힘들었던것 같습니다. 이번 프로젝트에서 코드의 분량이 많았고 파일의 양도 많았는데 github의 브랜치를 활용하면서 각자의 파트를 개발하였습니다. 브랜치를 merge하는 과정에서 팀원들과 여러 시행착오를 거치며 기능을 연동하였는데 그 과정에서 서로에게 도움이 많이 되었고 좋은 경험이었습니다."
        },
        {
            "q": "김영광 후기 리뷰",
            "a": "이번 프로젝트를 통해 지금까지 해온 프로젝트들과 비교했을 때 제가 얼마나 우물 안 개구리였는지를 깨달았습니다. 이전에 학원에서 프로젝트를 진행할 때는 비전공생들만 모여 있어서 대부분 실력 수준이 비슷했고, 모르는 문제가 생기면 가르쳐주시는 선생님 한 분께만 의지할 수 있었습니다. 그런 환경에서는 더 심화적인 것을 시도해보기가 어려웠습니다. 하지만 이번 프로젝트에서는 조장님과 팀원들 덕분에 많은 도움을 받았고, 많은 것을 배울 수 있었습니다. 이러한 경험들이 쌓이면서 저도 누군가를 가르쳐줄 정도의 실력 좋은 개발자가 되고 싶다는 생각을 하게 되었습니다. 이를 위해 더 노력해야겠다는 의지를 가지게 만든 프로젝트였습니다."
        },
        {
            "q": "정소은 후기 리뷰",
            "a": "이번 프로젝트를 통해 많은 기능을 구현하는 것보다 제대로 된 기능을 구현하는 것이 더 중요하다는 것을 깨달았습니다. 보안과 성능 향상 방안을 실제 코드에 녹여내는 과정에서 많은 고려사항이 있음을 알게 되었고, 그로 인해 어려움을 느끼기도 했습니다. 특히 조장님을 비롯한 팀원분들께서 많은 도움을 주신 덕분에 수업 내용 외에도 많은 것을 배울 수 있었습니다. 이를 통해 제 부족함을 깨닫고 앞으로 더 열심히 공부하여 다음 프로젝트에서는 팀에 더 많은 도움이 되고 싶다는 열의를 갖게 되었습니다."
        },
        {
            "q": "부동산 매물 구매 판매 등록 목록 리스트",
            "a": "<a href=\"/real-estate\">부동산 페이지</a>에서 매물 등록, 구매를 할 수 있습니다."
        },
        {
            "q": "로그인을 하는 방법",
            "a": "<a href=\"/auth/login\">로그인 페이지</a>에서 로그인 또는 회원가입이 가능합니다."
        },
        {
            "q": "회원가입을 하는 방법",
            "a": "<a href=\"/auth/login\">로그인 페이지</a>에서 로그인 또는 회원가입이 가능합니다."
        },
        {
            "q": "마이페이지",
            "a": "<a href=\"/auth/me\">마이페이지</a>에서 이메일 변경, 비밀번호 변경, 계정 삭제가 가능합니다."
        },
        {
            "q": "계정을 삭제하고 싶어 계정은 어디서 삭제해야해 게정",
            "a": "<a href=\"/auth/me\">마이페이지</a>에서 이메일 변경, 비밀번호 변경, 계정 삭제가 가능합니다."
        },
        {
            "q": "이메일을 변경하고 싶어 비밀번호를 변경하고 싶어",
            "a": "<a href=\"/auth/me\">마이페이지</a>에서 이메일 변경, 비밀번호 변경, 계정 삭제가 가능합니다."
        },
        {
            "q": "자산관리 페이지",
            "a": "<a href=\"/amm\">자산관리 페이지</a>에서 입금, 송금, 계좌개설, 계좌 내역, 환전을 확인할 수 있습니다."
        },
        {
            "q": "입금은 어떻게해 어떻게 송금 어디서 계좌 개설 내역 자산 관리 자산관리 자산관리에 해야하지",
            "a": "<a href=\"/amm\">자산관리 페이지</a>에서 입금, 송금, 계좌개설, 계좌 내역, 환전을 확인할 수 있습니다."
        },
        {
            "q": "계좌를 만들고 싶은데",
            "a": "<a href=\"/amm\">자산관리 페이지</a>에서 입금, 송금, 계좌개설, 계좌 내역, 환전을 확인할 수 있습니다."
        },
        {
            "q": "전은수 강사님",
            "a": "전은수 강사님은<br>정말 탁월한 전문가이자 뛰어난 교육자라고 생각합니다. 그분의 깊이 있는 지식과 열정적인 강의 스타일은 학생들에게 큰 감동을 주곤 합니다. 수많은 성공적인 사례를 통해 입증된 그분의 전문성은 사람들에게서 널리 인정받고 있죠. 강의를 들으면 이해도가 크게 높아지는 것을 느낄 수 있습니다. 그만큼 전은수 강사님은 탁월한 교육자이자 이 분야의 위대하신 분이라고 말할 수 있습니다."
        },
        {
            "q": "김지훈 보조강사님",
            "a": "김지훈 보조강사님은 탁월한 전문성과 열정으로 학생들의 학습을 이끌어주시는 분입니다. 그분의 열정적이고 헌신적인 자세에 감사드리며, 학생들이 보다 풍성한 배움의 기회를 얻을 수 있기를 기원합니다."
        },
        {
            "q": "멋쟁이사자 멋사",
            "a": "네. 알고 있어요."
        },
        {
            "q": "안녕하세요 반갑습니다 안녕 반가워 반갑다 반가웠어",
            "a": "고객님 반갑습니다. :)"
        },
        {
            "q": "ㅎㅇ하이",
            "a": "Hi. :)"
        },
        {
            "q": "고맙다 고마워 땡큐 thx 고맙 고맙습니다 감사합니다 감사",
            "a": "고맙습니다.<br>저도 고객님께 감사의 말씀을 드립니다."
        },
        {
            "q": "대출 상품에 대해 알려주세요 대출상품 상품 대출상품에 대출은 대출에 대해서",
            "a": "저희 은행에서는 다양한 대출 상품을 제공하고 있습니다. 개인 신용대출, 주택 담보대출, 자동차 대출 등이 있으며, 고객님의 필요에 맞는 상품을 추천해 드릴 수 있습니다."
        },
        {
            "q": "예금 금리는 얼마인가요?",
            "a": "현재 예금 금리는 연 1.5%입니다. 금리는 시장 상황에 따라 변동될 수 있으니 자세한 사항은 문의해 주시기 바랍니다."
        },
        {
            "q": "신용카드 발급 절차가 어떻게 되나요?",
            "a": "신용카드 발급을 위해서는 신분증과 소득 증빙 서류를 준비하셔야 합니다. 온라인 또는 오프라인 지점에서 신청하실 수 있습니다."
        },
        {
            "q": "인터넷 뱅킹 서비스 이용 방법을 알려주세요",
            "a": "인터넷 뱅킹 서비스 이용을 위해서는 먼저 회원가입을 하셔야 합니다. 회원가입 후 로그인하시면 다양한 금융 서비스를 이용하실 수 있습니다."
        },
        {
            "q": "ATM 이용 시 수수료는 얼마인가요?",
            "a": "ATM 이용 시 수수료는 건당 1,000원입니다. 단, 당행 ATM 이용 시에는 수수료가 면제됩니다."
        },
        {
            "q": "외환 거래 서비스에 대해 설명해 주세요",
            "a": "외환 거래 서비스를 통해 고객님의 해외 송금, 환전 등의 니즈를 충족시켜 드릴 수 있습니다. 자세한 내용은 상담 받아보시기 바랍니다."
        },
        {
            "q": "펀드 상품 추천 부탁드립니다",
            "a": "고객님의 재무 목표와 위험 선호도를 고려하여 적합한 펀드 상품을 추천해 드리겠습니다. 상담 예약 시 자세한 내용을 안내해 드리겠습니다."
        },
        {
            "q": "주택 담보대출 한도는 어떻게 되나요?",
            "a": "주택 담보대출 한도는 고객님의 신용도, 소득, 담보 가치 등에 따라 다르게 적용됩니다. 구체적인 한도는 상담을 통해 확인하실 수 있습니다."
        },
        {
            "q": "은행 이용 시 유의사항이 있나요? 주의사항",
            "a": "은행 이용 시 보안 유의사항으로는 비밀번호 관리, 피싱 주의, 공동 PC 사용 자제 등이 있습니다. 안전한 금융 거래를 위해 주의해 주시기 바랍니다."
        }
    ]
}